src/Documents/НачислениеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>НачислениеЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПерсоналом</xr:Item>
				<xr:Item>AccumulationRegister.Затраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Comment>Статья расходов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасчетЗарплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВычисляетсяВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачислениеУдержание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НачисленияИУдержанияСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧасовПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧасовФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>База</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НачисленияИУдержанияСотрудников</v8:Type>
								<v8:Type>cfg:CatalogRef.ПрочиеНачисленияИУдержания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>База</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Авансы</Name>
					<Comment>Авансы выданные сотрудникам</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма аванса</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрочиеНачисленияИУдержания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисление</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрочиеНачисленияИУдержания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/НастройкиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойШаблонОбследований</Name>
					<Comment>Основной шаблон обследований</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОбследований</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешитьПриемНесколькихПациентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СегментыНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяРучнаяСкидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыНачисленийУдержаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНачисленийУдержаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удержание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тариф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/НачислениеЗарплаты/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СтруктураМеню = Новый Структура;
	СтруктураМеню.Вставить("РасчетЗарплаты"				, "ГруппаРасчетЗарплаты");
	СтруктураМеню.Вставить("ПрочиеНачисленияИУдержания"	, "ГруппаПрочиеНачисленияИУдержания");
	СтруктураМеню.Вставить("Затраты"					, "ГруппаЗатраты");
	СтруктураМеню.Вставить("Авансы"						, "ГруппаАвансы");
	СтруктураМеню.Вставить("Дополнительно"				, "ГруппаДополнительно");
	
	ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, выполняет обработку нажатия кнопок динамического меню.
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры	

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора" поля ввода "Комментарий"
//
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСтоматология.ОткрытьФормуРедактированияКомментария(Элемент.ТекстРедактирования, Объект.Комментарий, Модифицированность);
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик события при изменении периода
Процедура ДатаНачалаПериодаПриИзменении(Элемент)
	
	Если Объект.ДатаНачалаПериода >= Объект.ДатаОкончанияПериода Тогда 
		Объект.ДатаОкончанияПериода = КонецМесяца(Объект.ДатаОкончанияПериода);
	КонецЕсли;
			
	Для Каждого ТекСтрокаРасчетЗарплаты Из Объект.РасчетЗарплаты Цикл
		ТекСтрокаРасчетЗарплаты.ПериодС = Объект.ДатаНачалаПериода;
		ТекСтрокаРасчетЗарплаты.ПериодПо = Объект.ДатаОкончанияПериода;
	КонецЦикла;
	
	РассчетБыл = Ложь;
	Для Каждого СтрокаТч Из Объект.РасчетЗарплаты Цикл		
		Если ЗначениеЗаполнено(СтрокаТч.Размер) Тогда
			РассчетБыл = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если РассчетБыл Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Новый ОписаниеОповещения("ДатаПериодаПриИзмененииЗавершение", ЭтотОбъект), "Пересчитать данные по заработной плате?", Режим, 0);
	КонецЕсли;  

КонецПроцедуры

&НаКлиенте
// Процедура обработчик события при изменении периода
Процедура ДатаОкончанияПериодаПриИзменении(Элемент)
	
	Для Каждого ТекСтрокаРасчетЗарплаты Из Объект.РасчетЗарплаты Цикл
		ТекСтрокаРасчетЗарплаты.ПериодПо = Объект.ДатаОкончанияПериода;
	КонецЦикла;
	
	РассчетБыл = Ложь;
	Для Каждого СтрокаТч Из Объект.РасчетЗарплаты Цикл		
		Если ЗначениеЗаполнено(СтрокаТч.Размер) Тогда
			РассчетБыл = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если РассчетБыл Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Новый ОписаниеОповещения("ДатаПериодаПриИзмененииЗавершение", ЭтотОбъект), "Пересчитать данные по заработной плате?", Режим, 0);
		
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Дата начала периода при изменении завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ДатаПериодаПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Рассчитать(Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РасчетЗарплатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "РасчетЗарплатыСотрудник" Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Сотрудник);
	ИначеЕсли Поле.Имя = "РасчетЗарплатыНачислениеУдержание" Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.НачислениеУдержание);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетЗарплатыБазаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.РасчетЗарплаты.ТекущиеДанные;
	Если Элемент <> Элементы.РасчетЗарплатыВычисляетсяВручную Тогда
		ТекущаяСтрока.ВычисляетсяВручную = Истина;
	КонецЕсли;
	
	// СтрокаТЧСтруктура = ОбщегоНазначенияКлиентСервер.КонвертироватьСтрокуТаблицыВСтруктуру(Объект.РасчетЗарплаты, ТекущаяСтрока, 
	//							"ВычисляетсяВручную,НачислениеУдержание,ПериодС,ПериодПо,ЧасовПлан,ДнейПлан,ЧасовФакт,ДнейФакт,База,Размер,Сумма");
	РассчитатьПоНачислениюНаСервере(Элементы.РасчетЗарплаты.ТекущаяСтрока);
	// ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТЧСтруктура);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "Дата".
//
Процедура ДатаПриИзменении(Элемент)

	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста  
// Функция, Получить данные даты при изменении.
//
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	РазностьДат = ДвиженияДокументовСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением);
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", РазностьДат);
			
	Возврат СтруктураДанные;
	
КонецФункции

&НаКлиенте
Процедура ПрочиеНачисленияИУдержанияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)	
	ПрочиеНачисленияИУдержанияПриИзмененииСервер();	
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеНачисленияИУдержанияПослеУдаления(Элемент)
	ПрочиеНачисленияИУдержанияПриИзмененииСервер();
КонецПроцедуры

&НаСервере
//
//
Процедура ПрочиеНачисленияИУдержанияПриИзмененииСервер()
	
	Если Элементы.ПрочиеНачисленияИУдержания.ТекущаяСтрока <> Неопределено Тогда
		ТекущиеДанные = объект.ПрочиеНачисленияИУдержания.НайтиПоИдентификатору(Элементы.ПрочиеНачисленияИУдержания.ТекущаяСтрока);
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.СтатьяРасходов) И ЗначениеЗаполнено(ТекущиеДанные.Начисление) Тогда
			Если ТекущиеДанные.Начисление.ТипНачисленияУдержания = ПредопределенноеЗначение("Перечисление.ТипыНачисленийУдержаний.Начисление") Тогда
				ТекущиеДанные.СтатьяРасходов = ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.ПрочееНачисление");
			Иначе
				ТекущиеДанные.СтатьяРасходов = ПредопределенноеЗначение("Справочник.СтатьиДоходовИРасходов.ПрочееУдержание");
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Счетчик = Объект.Затраты.Количество();
	Пока Счетчик > 0 Цикл 
		Если ТипЗнч(Объект.Затраты[Счетчик - 1].ВидНачисления) = Тип("СправочникСсылка.ПрочиеНачисленияИУдержания") Тогда 
			Объект.Затраты.Удалить(Счетчик - 1);	
		КонецЕсли;
		Счетчик = Счетчик - 1;
	КонецЦикла;	
	 
	Для Каждого СтрокаТЧ Из Объект.ПрочиеНачисленияИУдержания Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Начисление) Тогда		
			НоваяСтрока = Объект.Затраты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.ВидНачисления 	= СтрокаТЧ.Начисление;
			Если СтрокаТЧ.Начисление.ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Начисление Тогда 
				СтрокаТЧ.Сумма 		= ?(СтрокаТЧ.Сумма > 0, СтрокаТЧ.Сумма, СтрокаТЧ.Сумма*-1);
				НоваяСтрока.Размер 	= СтрокаТЧ.Сумма;
				НоваяСтрока.Сумма 	= НоваяСтрока.Размер;
			Иначе
				СтрокаТЧ.Сумма 		= ?(СтрокаТЧ.Сумма < 0, СтрокаТЧ.Сумма, СтрокаТЧ.Сумма*-1);
				НоваяСтрока.Размер 	= СтрокаТЧ.Сумма;
				НоваяСтрока.Сумма 	= НоваяСтрока.Размер;
			КонецЕсли;	
		КонецЕсли;			
	КонецЦикла;
		
	Объект.СуммаДокумента = Объект.РасчетЗарплаты.Итог("Сумма") + Объект.ПрочиеНачисленияИУдержания.Итог("Сумма");
	
КонецПроцедуры

&НаСервере
// Процедура - обработчик команды формы "ЗаполнитьНаСервере".
//
Процедура ЗаполнитьНаСервере(Добавить = Ложь, Сотрудник = Неопределено, ГруппаСотрудника = Неопределено, ДолжностьСотрудника = Неопределено)
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачалаПериода) И Не ЗначениеЗаполнено(Объект.ДатаОкончанияПериода) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен период!");
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НачисленияИУдержанияСотрудников.Владелец КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА НачисленияИУдержанияСотрудников.ЭтоГруппа
	|			ТОГДА НачисленияИУдержанияСотрудников.ВариантИспользования
	|		ИНАЧЕ НачисленияИУдержанияСотрудников.ПолноеНаименование
	|	КОНЕЦ КАК Описание,
	|	ВЫБОР
	|		КОГДА НачисленияИУдержанияСотрудников.НачалоПериода МЕЖДУ &НачалоПериода И &КонецПериода
	|			ТОГДА НачисленияИУдержанияСотрудников.НачалоПериода
	|		КОГДА НастройкиСотрудников.ДатаПриема МЕЖДУ &НачалоПериода И &КонецПериода
	|			ТОГДА НастройкиСотрудников.ДатаПриема
	|		ИНАЧЕ &НачалоПериода
	|	КОНЕЦ КАК ПериодС,
	|	ВЫБОР
	|		КОГДА НачисленияИУдержанияСотрудников.КонецПериода МЕЖДУ &НачалоПериода И &КонецПериода
	|			ТОГДА НачисленияИУдержанияСотрудников.КонецПериода
	|		КОГДА НастройкиСотрудников.ДатаУвольнения МЕЖДУ &НачалоПериода И &КонецПериода
	|			ТОГДА НастройкиСотрудников.ДатаУвольнения
	|		ИНАЧЕ &КонецПериода
	|	КОНЕЦ КАК ПериодПо,
	|	НачисленияИУдержанияСотрудников.Код КАК Код,
	|	НачисленияИУдержанияСотрудников.Ссылка КАК НачислениеУдержание
	|ИЗ
	|	Справочник.НачисленияИУдержанияСотрудников КАК НачисленияИУдержанияСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|		ПО НачисленияИУдержанияСотрудников.Владелец = НастройкиСотрудников.Сотрудник
	|			И НачисленияИУдержанияСотрудников.СтруктурнаяЕдиница = НастройкиСотрудников.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияИУдержанияСотрудников.ЭтоГруппа = ЛОЖЬ
	|	И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И НачисленияИУдержанияСотрудников.ПометкаУдаления = ЛОЖЬ
	|	И (НачисленияИУдержанияСотрудников.КонецПериода >= &НачалоПериода
	|			ИЛИ НачисленияИУдержанияСотрудников.КонецПериода = ДАТАВРЕМЯ(1, 1, 1))
	|	И НачисленияИУдержанияСотрудников.НачалоПериода <= &КонецПериода
	|	И (НастройкиСотрудников.ДатаУвольнения >= &НачалоПериода
	|			ИЛИ НастройкиСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1))
	|	И (НастройкиСотрудников.ДатаПриема <= &КонецПериода
	|			ИЛИ НастройкиСотрудников.ДатаПриема = ДАТАВРЕМЯ(1, 1, 1))"
		+ ?(ЗначениеЗаполнено(Сотрудник)			, Символы.ПС + "	И НачисленияИУдержанияСотрудников.Владелец = &Сотрудник ", "") 
		+ ?(ЗначениеЗаполнено(ДолжностьСотрудника)	, Символы.ПС + "	И НачисленияИУдержанияСотрудников.Владелец.Должность = &Должность ", "") 
		+ ?(ЗначениеЗаполнено(ГруппаСотрудника)		, Символы.ПС + "	И НачисленияИУдержанияСотрудников.Владелец В ИЕРАРХИИ (&ГруппаСотрудника) ", "")
		+ "
	|УПОРЯДОЧИТЬ ПО
	|	НачисленияИУдержанияСотрудников.Владелец.Наименование, НачисленияИУдержанияСотрудников.Ссылка.Наименование";
				
	Запрос.УстановитьПараметр("НачалоПериода", Объект.ДатаНачалаПериода);
	Запрос.УстановитьПараметр("КонецПериода", Объект.ДатаОкончанияПериода);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Должность", ДолжностьСотрудника);
	Запрос.УстановитьПараметр("ГруппаСотрудника", ГруппаСотрудника);
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Если Добавить Тогда
		ПараметрыПоиска = Новый Структура("Сотрудник, Код, НачислениеУдержание");
		Для Каждого СтрокаТЧ Из ТаблицаРезультат Цикл
			ЗаполнитьЗначенияСвойств(ПараметрыПоиска, СтрокаТЧ);
			Если Объект.РасчетЗарплаты.НайтиСтроки(ПараметрыПоиска).Количество() <= 0 Тогда
				НоваяСтрока = Объект.РасчетЗарплаты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Объект.РасчетЗарплаты.Очистить();
		Объект.РасчетЗарплаты.Загрузить(ТаблицаРезультат);
	КонецЕсли;
	
	Объект.РасчетЗарплаты.Сортировать("Сотрудник Возр");
	ДополнитьТаблицуРасчетаДаннымиНачисления();
	
	// Заполнить таблицу "Авансы"
	ЗаполнитьАвансыНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура РасчетЗарплатыПослеУдаления(Элемент)
	
	РассчитатьНаСервере();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура РасчетЗарплатыПриИзменении(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ПрочиеНачисленияИУдержанияПриИзменении(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ЗатратыПриИзменении(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура АвансыПриИзменении(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
// Процедура - обработчик команды формы "ЗаполнитьПоСотруднику".
//
Процедура ЗаполнитьПоСотруднику(Команда)

	СтруктураПараметры = Новый Структура("ОтборСтруктурнаяЕдиница, БезОтбораПоРолям", Объект.СтруктурнаяЕдиница, Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоСотрудникуЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора",СтруктураПараметры ,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

// Процедура - Заполнить по сотруднику завершение
// Завершение немодального открытия окна формы - Справочник Сотрудники - ФормаВыбора
// Параметры:
//  Результат	 - 	 Результат Оповещения 
//  Параметры	 - 	 Параметры Оповещения 
//
&НаКлиенте
Процедура ЗаполнитьПоСотрудникуЗавершение(Результат, Параметры)  Экспорт

	Сотрудник = Результат;
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		ЗаполнитьНаСервере(,Сотрудник);
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды формы "ЗаполнитьПоДолжности".
//
Процедура ЗаполнитьПоДолжности(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоДолжностиЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Должности.ФормаВыбора",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

// Процедура - Заполнить по должности завершение
// Завершение немодального открытия окна формы - Справочник Должности - ФормаВыбора
// Параметры:
//  Результат	 - 	 Результат Оповещения  
//  Параметры	 - 	 Параметры Оповещения 
//
&НаКлиенте
Процедура ЗаполнитьПоДолжностиЗавершение(Результат, Параметры)  Экспорт

	Должность = Результат;
	Если ЗначениеЗаполнено(Должность) Тогда
		ЗаполнитьНаСервере(,,,Должность);
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды формы "ЗаполнитьПоГруппеСотрудников".
//
Процедура ЗаполнитьПоГруппеСотрудников(Команда)
	
	СтруктураПараметры = Новый Структура("ОтборСтруктурнаяЕдиница, ПоГруппеСотрудников", Объект.СтруктурнаяЕдиница, Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоГруппеСотрудниковЗавершение", ЭтотОбъект);
			
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбораГруппы", СтруктураПараметры,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

// Процедура - Заполнить по группе сотрудников завершение
// Завершение немодального открытия окна формы - Справочник Сотрудники - ФормаВыбора
// Параметры:
//  Результат	 - 	 Результат Оповещения  
//  Параметры	 - 	 Параметры Оповещения  
//
&НаКлиенте
Процедура ЗаполнитьПоГруппеСотрудниковЗавершение(Результат, Параметры)  Экспорт

	ГруппаСотрудника = Результат;
	Если ЗначениеЗаполнено(ГруппаСотрудника) Тогда 
		ЗаполнитьНаСервере(,,ГруппаСотрудника);
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды формы "ЗаполнитьПоГруппеСотрудников".
//
Процедура ЗаполнитьВсехСотрудников(Команда)
	
	ЗаполнитьНаСервере();

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды формы "ДобавитьПоСотруднику".
//
Процедура ДобавитьПоСотруднику(Команда)
	
	СтруктураПараметры = Новый Структура("ОтборСтруктурнаяЕдиница, БезОтбораПоРолям", Объект.СтруктурнаяЕдиница, Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьПоСотрудникуЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", СтруктураПараметры,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды формы "ДобавитьПоДолжности".
//
Процедура ДобавитьПоДолжности(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьПоДолжностиЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Должности.ФормаВыбора",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды формы "ДобавитьПоГруппеСотрудников".
//
Процедура ДобавитьПоГруппеСотрудников(Команда)
	
	СтруктураПараметры = Новый Структура("ОтборСтруктурнаяЕдиница, ПоГруппеСотрудников", Объект.СтруктурнаяЕдиница, Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьПоГруппеСотрудниковЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбораГруппы", СтруктураПараметры,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

// Процедура - Добавить по сотруднику завершение
// Завершение немодального открытия окна формы - Справочник Сотрудники - ФормаВыбора
// Параметры:
//  Результат	 - 	 Результат Оповещения 
//  Параметры	 - 	 Параметры Оповещения  
//
&НаКлиенте
Процедура ДобавитьПоСотрудникуЗавершение(Результат, Параметры)  Экспорт
	
	Сотрудник = Результат;
	Если ЗначениеЗаполнено(Сотрудник) Тогда 
		ЗаполнитьНаСервере(Истина, Сотрудник);
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Добавить по должности завершение
// Завершение немодального открытия окна формы - Справочник Должности - ФормаВыбор
// Параметры:
//  Результат	 - 	 Результат Оповещения  
//  Параметры	 - 	 Параметры Оповещения 
//
&НаКлиенте
Процедура ДобавитьПоДолжностиЗавершение(Результат, Параметры)  Экспорт

	Должность = Результат;
	Если ЗначениеЗаполнено(Должность) Тогда
		ЗаполнитьНаСервере(Истина,,,Должность);
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Добавить по группе сотрудников завершение
// Завершение немодального открытия окна формы - Справочник Сотрудники - ФормаВыбора
// Параметры:
//  Результат	 - 	 Результат Оповещения  
//  Параметры	 - 	 Параметры Оповещения 
//
&НаКлиенте
Процедура ДобавитьПоГруппеСотрудниковЗавершение(Результат, Параметры)  Экспорт

	ГруппаСотрудника = Результат;
	Если ЗначениеЗаполнено(ГруппаСотрудника) Тогда
		ЗаполнитьНаСервере(Истина,,ГруппаСотрудника);
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
// Процедура - обработчик команды формы "Рассчитать".
//
Процедура Рассчитать(Команда)
	
	ОчиститьСообщения();
	Результат = ПроверитьЗаполнение();
	
	Если Результат Тогда 
		РассчитатьНаСервере();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура печати документов.
//
Процедура ДокументПечать(Команда)
	
	МассивДокументов = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		МассивДокументов.Добавить(Объект.Ссылка);
	КонецЕсли;
		
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "НачислениеЗарплаты");
	Структура.Вставить("МассивДокументов", МассивДокументов);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		
		СтруктураВопроса = Новый Структура;
		СтруктураВопроса.Вставить("СписокПечатныхФорм", СписокПечатныхФорм);
		СтруктураВопроса.Вставить("Оповещение", Оповещение);
		ОповещениеДляВопроса = Новый ОписаниеОповещения("ПослеВопросаЗавершение", ЭтотОбъект, СтруктураВопроса);			
		ПоказатьВопрос(ОповещениеДляВопроса, "Данные ещё не записаны. Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе	
		
		ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, Элементы.ФормаДокументаПечать);
		
	КонецЕсли;   				
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
///////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ

&НаСервере
// Процедура - обработчик команды формы "Рассчитать".
//
Процедура РассчитатьНаСервере()
	
	Документы.НачислениеЗарплаты.РассчитатьЗарплатуПоДокументу(Объект);
	
КонецПроцедуры

&НаСервере
// Процедура - обработчик команды формы "Рассчитать".
//
Процедура РассчитатьПоНачислениюНаСервере(ИдентификаторСтрокиТЧ)
	
	Если ТипЗнч(ИдентификаторСтрокиТЧ) = Тип("Число") Тогда
		СтрокаТЧ = Объект.РасчетЗарплаты.НайтиПоИдентификатору(ИдентификаторСтрокиТЧ);
	Иначе
		СтрокаТЧ = ИдентификаторСтрокиТЧ;
	КонецЕсли; 
	
	ЭлементыДляУдаления = Объект.Затраты.НайтиСтроки(Новый Структура("ВидНачисления", СтрокаТЧ.НачислениеУдержание));
	Для Каждого УдаляемыйЭлемент Из ЭлементыДляУдаления Цикл
		Объект.Затраты.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	
	ТаблицаРасшифровкиНачислений = Документы.НачислениеЗарплаты.РассчитатьЗарплатуПоНачислению(СтрокаТЧ.НачислениеУдержание, СтрокаТЧ.ПериодС, СтрокаТЧ.ПериодПо, ?(СтрокаТЧ.ВычисляетсяВручную, СтрокаТЧ, Неопределено));
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаРасшифровкиНачислений, Объект.Затраты);
	Объект.Затраты.Сортировать("Сотрудник, Дата, ВидНачисления");
	
	ИмяВремени = ?(СтрокаТЧ.НачислениеУдержание.ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Тариф И СтрокаТЧ.НачислениеУдержание.ТипТарифа = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаЧас
			ИЛИ СтрокаТЧ.НачислениеУдержание.ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Тариф И СтрокаТЧ.НачислениеУдержание.ТипТарифа = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗаЧасАссистирования
			ИЛИ СтрокаТЧ.НачислениеУдержание.ТипНачисленияУдержания = Перечисления.ТипыНачисленийУдержаний.Оклад И СтрокаТЧ.НачислениеУдержание.ЗависимостьОтВыработки = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ЗависитОтВыработки И СтрокаТЧ.НачислениеУдержание.ТипПериодаНачисления = Перечисления.ВариантыЗначенийПоВидамНачисленийУдержаний.ПоЧасам, "Часов", "Дней");
	// Если СтрокаТЧ.ВычисляетсяВручную Тогда
	//	СтрокаТЧ.Сумма = ТаблицаРасшифровкиНачислений.Итог("Сумма");
	// Иначе
		СтрокаТЧ.ЧасовПлан = 0; СтрокаТЧ.ДнейПлан = 0; СтрокаТЧ.ЧасовФакт = 0; СтрокаТЧ.ДнейФакт = 0;		
		СтрокаТЧ[ИмяВремени + "План"] = ?(ТаблицаРасшифровкиНачислений.Количество() > 0, ТаблицаРасшифровкиНачислений[0].План, 0);
		СтрокаТЧ[ИмяВремени + "Факт"] = ТаблицаРасшифровкиНачислений.Итог("Факт");
		СтрокаТЧ.База = ТаблицаРасшифровкиНачислений.Итог("База");
		СтрокаТЧ.Размер = ?(ТаблицаРасшифровкиНачислений.Количество() > 0, ТаблицаРасшифровкиНачислений[0].Размер, СтрокаТЧ.НачислениеУдержание.Размер);
		СтрокаТЧ.Сумма = ТаблицаРасшифровкиНачислений.Итог("Сумма");
	// КонецЕсли;
	
	Объект.СуммаДокумента = Объект.РасчетЗарплаты.Итог("Сумма") + Объект.ПрочиеНачисленияИУдержания.Итог("Сумма");	
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьТаблицуРасчетаДаннымиНачисления()
	
	Для Каждого СтрокаТЧ Из Объект.РасчетЗарплаты Цикл
		СтрокаТЧ.НУ_НачислениеУдержание 	= СтрокаТЧ.НачислениеУдержание.НачислениеУдержание;
		СтрокаТЧ.НУ_ТипНачисленияУдержания 	= СтрокаТЧ.НачислениеУдержание.ТипНачисленияУдержания;
		СтрокаТЧ.НУ_ЗависимостьОтВыработки 	= СтрокаТЧ.НачислениеУдержание.ЗависимостьОтВыработки;
		СтрокаТЧ.НУ_ТипПериодаНачисления 	= СтрокаТЧ.НачислениеУдержание.ТипПериодаНачисления;
		СтрокаТЧ.НУ_ТипТарифа 				= СтрокаТЧ.НачислениеУдержание.ТипТарифа;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДополнитьТаблицуРасчетаДаннымиНачисления();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансы(Команда)
	
	ЗаполнитьАвансыНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвансыНаСервере()
	
	// Заполнить таблицу "Авансы"
	МассивСотрудников = Новый Массив;
	Для Каждого СтрокаТЧ ИЗ Объект.РасчетЗарплаты Цикл
		МассивСотрудников.Добавить(СтрокаТЧ.Сотрудник);
	КонецЦикла;
	Для Каждого СтрокаТЧ ИЗ Объект.ПрочиеНачисленияИУдержания Цикл
		МассивСотрудников.Добавить(СтрокаТЧ.Сотрудник);
	КонецЦикла;
	
	Документы.НачислениеЗарплаты.ЗаполнитьТаблицуАвансов(Объект, Объект.СтруктурнаяЕдиница, НачалоМесяца(Объект.ДатаНачалаПериода), МассивСотрудников, Объект.Ссылка)
	
КонецПроцедуры

&НаКлиенте
// Процедура После вопроса завврешение.
//
Процедура ПослеВопросаЗавершение(Результат, Параметры) Экспорт	
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ПроверитьЗаполнение() = Истина Тогда		
			ЭтаФорма.Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));			
		КонецЕсли; 		
		// ПоказатьВыборИзМеню(Параметры.Оповещение, Параметры.СписокПечатныхФорм, Элементы.ФормаДокументаПечать);		
	Иначе
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()
	Возврат Документы.НачислениеЗарплаты.ПолучитьСписокПечатныхФорм();	
КонецФункции

#КонецОбласти
